{"class_name": "Sequential", "loss": "binary_crossentropy", "sample_weight_mode": null, "optimizer": {"beta_1": 0.8999999761581421, "name": "Adam", "beta_2": 0.9990000128746033, "epsilon": 1e-08, "lr": 0.0010000000474974513}, "config": [{"class_name": "Embedding", "config": {"output_dim": 128, "name": "embedding_1", "input_dim": 20000, "activity_regularizer": null, "dropout": 0.2, "input_length": 7, "W_regularizer": null, "trainable": true, "mask_zero": false, "batch_input_shape": [null, 7], "input_dtype": "int32", "init": "uniform", "W_constraint": null}}, {"class_name": "LSTM", "config": {"stateful": false, "input_dim": 128, "go_backwards": false, "return_sequences": false, "input_length": null, "inner_activation": "hard_sigmoid", "dropout_W": 0.2, "trainable": true, "batch_input_shape": [null, null, 128], "name": "lstm_1", "activation": "tanh", "U_regularizer": null, "consume_less": "cpu", "dropout_U": 0.2, "inner_init": "orthogonal", "unroll": false, "b_regularizer": null, "W_regularizer": null, "forget_bias_init": "one", "input_dtype": "float32", "init": "glorot_uniform", "output_dim": 128}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "activation": "linear", "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "output_dim": 1, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}], "keras_version": "1.0.4"}