{"loss": "binary_crossentropy", "sample_weight_mode": null, "optimizer": {"name": "Adam", "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "beta_1": 0.8999999761581421}, "keras_version": "1.0.4", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "batch_input_shape": [null, 7], "init": "uniform", "W_constraint": null, "W_regularizer": null, "dropout": 0.2, "input_length": 7, "output_dim": 128, "input_dim": 20000, "input_dtype": "int32", "activity_regularizer": null, "trainable": true, "mask_zero": false}}, {"class_name": "LSTM", "config": {"batch_input_shape": [null, null, 128], "unroll": false, "consume_less": "cpu", "dropout_W": 0.2, "inner_init": "orthogonal", "go_backwards": false, "forget_bias_init": "one", "inner_activation": "hard_sigmoid", "input_dim": 128, "input_dtype": "float32", "name": "lstm_1", "return_sequences": false, "init": "glorot_uniform", "input_length": null, "stateful": false, "b_regularizer": null, "activation": "tanh", "output_dim": 128, "W_regularizer": null, "U_regularizer": null, "dropout_U": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "output_dim": 1, "input_dim": null, "activity_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}]}